rental_service/app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
---
  def show
    @page = Page.find(params[:id])

INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (1, 'Hello', 'aaaaa', 1, TRUE, '2018-11-07 16:12:51', '2018-11-07 16:12:51')
---
  def create
    @page = Page.new(page_params)
    if @page.save

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
---
  def edit
    @page = Page.find(params[:id])

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
UPDATE `pages` SET `name` = 'Hello 123', `updated_at` = '2018-11-07 16:13:04' WHERE `pages`.`id` = 1
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)