rental_service/app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def create
    @section = Section.new(section_params)
    if @section.save
---
INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (1, 'Hi', 1, TRUE, 'Content', 'gogogo', '2018-11-07 16:13:41', '2018-11-07 16:13:41')

  def edit
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def delete
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1