rental_service/app/controllers/subjects_controller.rb

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('First Subject', 1, TRUE, '2018-11-08 18:28:36', '2018-11-08 18:28:36')
---
  def create
    @subject = Subject.new(subject_params)
    if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
---
  def edit
    @subject = Subject.find(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `name` = 'second Subject', `updated_at` = '2018-11-09 08:40:02' WHERE `subjects`.`id` = 1
---
  def update
    @subject = Subject.find(params[:id])
    if @subject.update_attributes(subject_params)

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 7 LIMIT 1
---
  def delete
    @subject = Subject.find(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 1
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy